exampleCases/tut.ABLflatTerrain.precursor/0.original/qwall.wrf
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  6
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/

FoamFile
{
    version     2.0;
    format      ascii;
    class       volVectorField;
    location    "0";
    object      qwall;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

#include        "../setUp"

dimensions      [ 0 1 -1 1 0 0 0 ];

internalField   uniform (0.0 0.0 0.0);

boundaryField
{
    lower
    {
        // ---------------------------------------------
        // Use `uniformFixedValue` if giving a q history
        //  type             uniformFixedValue;
        //  uniformValue     table
        //  (
        //      #include "../constant/drivingData/qwallTable"
        //  );

        // -----------------------------------------------------------
        // Use `specifiedSurfaceTemperature` if giving a theta history
        type            specifiedSurfaceTemperature;
        TSurface        table
        (
            #include "../../drivingData/surfaceSkinPotentialTemperatureTable"
        );
        kappa           $kappa;
        z0              uniform $z0;
        betaM           $betaM;
        gammaM          $gammaM;
        betaH           $betaH;
        gammaH          $gammaH;
        alphaH          $alphaH;
        averageType     "planarAverage";
        value           uniform $qwall;
    }
    upper
    {
        type            fixedValue;
        value           $internalField;
    }
    west 
    {
        type            cyclic;
    }
    east 
    {
        type            cyclic;
    }
    north 
    {
        type            cyclic;
    }
    south
    {
        type            cyclic;
    }
}


// ************************************************************************* //
