exampleCases/tut.ABLflatTerrain.precursor/constant/ABLProperties
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  6
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/

FoamFile
{
    version         2.0;
    format          ascii;

    root            "";
    case            "";
    instance        "";
    local           "";

    class           dictionary;
    object          ABLProperties;
}

// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

#include        "../setUp"


// Properties of the background forcing source term
momentumSource
{
    type        "computed";
    inputType   "speedAndDirection";

    //Relaxation factor (only used when type is "computed")
    gain        0.7;

    sourceHeightsMomentum
    (
        $windControlHeight
    );
    
    sourceTableMomentumX
    (
        (    0.0 $windSpeed)
        (90000.0 $windSpeed)
    );
    
    sourceTableMomentumY
    (
        (    0.0 $windDir)
        (90000.0 $windDir)
    );
    
    sourceTableMomentumZ
    (
        (    0.0 0.0)
        (90000.0 0.0)
    );
}

temperatureSource
{
    type        "given";

    //Relaxation factor (only used when type is "computed")
    gain        0.7;

    sourceHeightsTemperature
    (
        $windControlHeight
    );
    
    sourceTableTemperature
    (
        (    0.0 0.0)
        (90000.0 0.0)
    );
}

// Pressure splitting type
// Note: before Feb/2021 the default was `rhokSplit`, and now the default is `rho0Split`
perturbationPressureType  rho0Split;


// Properties of the Coriolis force
planetaryRotationPeriod   $EarthPeriod;
latitude                  $latitude;


// Write out postProcessing/sourceHistory
writeSource             $writeSource;
writeSourceInterval     $writeSourceInterval;


// ************************************************************************* //
