exampleCases/tut.ABLflatTerrain.precursor/system/fvSchemes
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  6
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/

FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    location    "system";
    object      fvSchemes;
}

// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

#include    "../setUp"

ddtSchemes
{
    default                        backward;
//  default                        CrankNicolson 1.0;
}

gradSchemes
{
    default                        Gauss linear;
    grad(U)                        Gauss linear;
    grad(T)                        Gauss linear;
}

divSchemes
{
    default                        Gauss linear;
  //div(phi,U)                     Gauss linear;
  //div(phi,T)                     Gauss linear;
    div(phi,U)                     Gauss localBlended linear upwind;
    div(phi,T)                     Gauss localBlended linear upwind;
  //div(phi,U)                     Gauss localBlended linear linearUpwind grad(U);
  //div(phi,T)                     Gauss localBlended linear linearUpwind grad(T);
    div(R)                         Gauss linear;
    div(U)                         Gauss linear;
    div((nuEff*dev(grad(U).T())))  Gauss linear;
    div(B)                         Gauss linear;
    div(phi,B)                     Gauss linear;
    div(phi,k)                     Gauss linear;
}

laplacianSchemes
{
    default                        Gauss linear uncorrected;
    laplacian(rUA,p)               Gauss linear uncorrected;
    laplacian((1|A(U)),p)          Gauss linear uncorrected;
    laplacian(interpolate((1|A(U))),p) Gauss linear uncorrected;
    laplacian(interpolate((1|A(U))),pd) Gauss linear uncorrected;
    laplacian(nu,U)                Gauss linear uncorrected;
    laplacian(nuEff,U)             Gauss linear uncorrected;
    laplacian(kappaEff,T)          Gauss linear uncorrected;
    laplacian(DBEff,B)             Gauss linear uncorrected;
    laplacian(nuSgs,U)             Gauss linear uncorrected;
}

interpolationSchemes
{
    default                        linear;
}

snGradSchemes
{
    default                        uncorrected;
}

fluxRequired
{
    default                        no;
    p_rgh                            ;
}

wallDist
{
    method meshWave;

    // Optional entry enabling the calculation
    // of the normal-to-wall field
    nRequired false;
}

schemeBlending
{

    // Table of blending factors vs. cell face size.
    faceSizeBlendingTable
    (
    // area          U        T
        (0.096      0.996  0.980 )
        (0.39       0.996  0.980 )
        (1.563      0.997  0.985 )
        (6.25       0.998  0.990 )
        (25         0.999  0.995 )
        (100        1.000  1.000 )
        (1E6        1.000  1.000 )
    );


    // Height above which blending factor begins to transition
    // from heightBlendingFactor_z1 to heightBlendingFactor_z2.
    heightBlending_z1            #calc "$zMin+($zMax-$zMin)*0.55";

    // Height above which blending factor is heightBlendingFactor_z2.
    heightBlending_z2            #calc "$zMin+($zMax-$zMin)*0.6";


    heightBlendingFactorU_z1     1.0;
    heightBlendingFactorU_z2     0.975;

    heightBlendingFactorT_z1     1.0;
    heightBlendingFactorT_z2     0.975;


    // In calculating height, use wall distance or absolute distance.
    useWallDistZ                 false;
}

// ************************************************************************* //
